/* 
  Common.strings
  Secrets

  Created by Paulo Andrade on 29/11/14.
  Copyright (c) 2016 Outer Corner. All rights reserved.
*/

"Passphrase" = "Palavra-passe";
"ConfirmPassphrase" = "Confirmar palavra-passe";
"EnterPassphrase" = "Insira a sua palavra-passe";


// password strength
"PasswordScore.VeryWeak" = "muito fraca";
"PasswordScore.Weak" = "fraca";
"PasswordScore.OK" = "ok";
"PasswordScore.Good" = "boa";
"PasswordScore.Excellent" = "muito boa";


// Button titles
"Button.Show" = "Mostrar";
"Button.Hide" = "Esconder";
"Button.Copy" = "Copiar";
"Button.Reveal" = "Mostrar";
"Button.Conceal" = "Ocultar";
"Button.Recover" = "Recuperar";
"Button.Trash" = "Lixo";
"Button.MoveToTrash" = "Mover para o Lixo";
"Button.Cancel" = "Cancelar";
"Button.OK" = "OK";
"Button.Done" = "OK";
"Button.Continue" = "Continuar";
"Button.Close" = "Fechar";
"Button.Edit" = "Editar";
"Button.Back" = "Voltar";
"Button.Fill" = "Preencher";
"Button.Send" = "Enviar";
"Button.FillOptions" = "Preencher…";
"Button.AssociateAndFill" = "Associar & Preencher";
"Button.Delete" = "Apagar";
"Button.Add" = "Adicionar";
"Button.Restore" = "Restaurar";
"Button.Sync" = "Sincronizar";
"Button.NotNow" = "Agora não";
"Button.Update" = "Atualizar";
"Button.ChangePassphrase" = "Alterar palavra-passe";
"Button.Change" = "Alterar";
"Button.DeleteiCloudData" = "Apagar dados do iCloud";
"Button.YesSure" = "Sim, de certeza";
"Button.YesDelete" = "Sim, apagar";
"Button.Reset" = "Restaurar";
"Button.Unlock" = "Destrancar";
"Button.Enable" = "Ativar";
"Button.Disable" = "Desativar";
"Button.Dismiss" = "Fechar";
"Button.Refresh" = "Atualizar";
"Button.Upgrade" = "Atualizar";

// Filters
"Filter.All" = "Todos";
"Filter.AllItems" = "Todos os itens";
"Filter.Trash" = "Lixo";


/* Copy item action */
"Action.CopyItem" = "Copiar %@";
"Action.CopyItem2Lines" = "Copiar\n%@";
"Action.RevealItem" = "Mostrar %@";
"Action.ConcealItem" = "Esconder %@";
"Action.RecoverItem" = "Recuperar %@";
"Action.FillItem" = "Preencher %@";
"Action.SendItem" = "Enviar %@ para a aplicação";
"Action.MoveItemToTrash" = "Mover %@ para o lixo";
"Action.DeleteItem" = "Apagar %@";

/* Option presented when nothing is found for a given search string. Eg: Add Login for "twitter" */
"Search.AddItem" = "Adicionar %@ para \"%@\"";
/* Presented when nothing is found for a given search string. Eg: No logins found */
"Search.NoResultsTitle" = "Sem resultados para %@";
/* Presented when nothing is found for a given search string. Eg: Couldn't find any logins matching you search. */
"Search.NoResultsDetailed" = "A pesquisa em %@ não produziu nenhum resultado.";
/* Trash is empty title */
"Search.TrashEmptyTitle" = "Nenhum item no lixo";
/* Trash is empty message */
"Search.TrashEmptyMessage" = "Parece que ainda não enviou nenhum item para o lixo";
/* Empty section title */
"Search.SectionEmptyTitle" = "Sem %@ para mostrar";
/* Empty section message */
"Search.SectionEmptyMessage" = "Carregue no botão + em cima para adicionar %@.";
/* Empty section message touch */
"Search.SectionEmptyMessageTouch" = "Carregue no botão + em baixo para adicionar %@.";


// iCloud & Sync
"iCloud.CredentialItemName" = "Palavra-passe de sincronização do iCloud do %@";
"iCloud.CredentialNoteContent" = "Este item foi automáticamente gerado aquando da configuração do iCloud. É usado internamente para sincronizar com o mesmo. Pode alterar o nome e/ou o utilizador, mas deixe a palavra-passe e o serviço de iCloud associado intactos. Obrigado.";
/* Merge notice */
"Sync.AutomaticallyMergedNotice" = "Combinado automáticamente devido a um conflito em %@";
/* Presented on a small overlay when the app is syncing */
"Sync.Syncing" = "Sincronização";
/* Presented when iCloud sync is uploading the file data */
"Sync.WaitingForUpload" = "À espera que o envio acabe";
/* Last sync date */
"Sync.LastSynced" = "Última sincronização: %@";
/* Title for "passphrase not synced" alert */
"iCloud.ChangePassphraseAlert.Title" = "A sua palavra-passe não é sincronizada via iCloud";
/* Message for "passphrase not synced" alert */
"iCloud.ChangePassphraseAlert.Message" = "É necessário atualizar a sua palavra-passe manualmente nos seus outros dispositivos para que continuem a usar o iCloud Sync";

/* Asked during setup when iCloud data already exists */
"iCloud.ShouldRestore" = "Pretende restaurar os seus dados do iCloud?";
/* Asked during setup when creating a new iCloud store */
"iCloud.ShouldSync" = "Pretende sincronizar via iCloud?";

"iCloud.SetupFailedAlert.Title" = "Impossível ativar iCloud Sync";
"iCloud.SetupFailedAlert.Message" = "Por tente ativar novamente mais tarde";
"iCloud.SetupFailedAlert.MessageTouch" = "Por tente ativar novamente mais tarde nas Definições";

/* Presented during setup while checking for iCloud data */
"iCloud.CheckingiCloud" = "A verificar iCloud…";

/* Alert title when trying to enable iCloud syncing */
"iCloud.NotAvailableAlert.Title" = "iCloud não disponível";
/* Alert message when trying to enable iCloud syncing */
"iCloud.NotAvailableAlert.Message" = "Por favor certifique-se que iniciou sessão no iCloud e tem os \"Dados & Documentos\" ativos nas Preferências do Sistema.";
"iCloud.NotAvailableAlert.MessageTouch" = "Por favor certifique-se que iniciou sessão no iCloud.";

/* Disable iCloud confirmation dialog title */
"iCloud.DisableSyncAlert.Title" = "Tem a certeza que quer desativar o iCloud Sync?";
/* Disable iCloud confirmation dialog message */
"iCloud.DisableSyncAlert.Message" = "Ao desativar a sincronização, alterações efetuadas neste dispositivo não serão enviadas para o iCloud e vice versa";

/* Delete iCloud confirmation dialog title */
"iCloud.DeleteDataAlert.Title" = "Tem a certeza que deseja apagar os seus dados do iCloud?";
/* Delete iCloud confirmation dialog message */
"iCloud.DeleteDataAlert.Message" = "Isto vai impedir que qualquer outro dispositivo associado ao iCloud continue a sincronizado. Será necessário voltar a configurar o iCloud em todos eles.";

/* Sync with iCloud setting */
"iCloud.SyncSetting" = "Sincronizar via iCloud";
/* Sync with iCloud explanation */
"iCloud.Info" = "O iCloud Sync permite-lhe aceder aos seus dados em todos os seus dispositivos.";
/* iCloud Sync footer explanation when iCloud store file is missing */
"iCloud.Status.Missing" = "Dados do iCloud em falta. Pode tê-los apagado noutro dispositivo. Para voltar a usar o iCloud Sync terá que desativar e ativar novamente.";
/* iCloud Sync footer explanation when iCloud is unavailable but enabled */
"iCloud.Status.EnabledButUnavailable" = "iCloud não está acessível. Pode ter terminado a sessão de iCloud ou iniciado com um utilizador diferente.";
/* iCloud Sync footer explanation when iCloud is unavailable and disabled */
"iCloud.Status.DisabledAndUnavailable" = "iCloud não está acessível. Pode ter terminado a sessão de iCloud.";



/* Delete multiple item confirmation alert title */
"Alert.PermanentlyDelete.Title" = "Apagar %d itens permanentemente";
/* Delete multiple item confirmation alert message */
"Alert.PermanentlyDelete.Message" = "Tem a certeza que deseja apagar estes %d itens?";

"Alert.PremiumRequired.Title" = "Versão Premium necessária";
"Alert.PremiumRequired.Message" = "Atualize para o Premium para continuar a sincronizar mais de %d itens";

// Store
"Store.Version.Free" = "Grátis";
"Store.Version.Premium" = "Premium";

"Store.Button.Buy" = "Comprar %@";
"Store.Button.Restore" = "Já comprou? Restaurar ≫";

"Store.PremiumUpgrade.Title" = "Atualize para Premium";
"Store.PremiumUpgrade.Message" = "Ao atualizar poderá criar itens ilimitados. Só é necessário comprar uma vez.";

"Store.ProcessingTransaction.Title" = "A processar…";
"Store.ProcessingTransaction.Message" = "A aguardar que a transação termine.";

"Store.HasPremium.Title" = "Premium Ativado 🎉";
"Store.HasPremium.Message" = "Você tem a versão Premium do Secrets. Obrigado!";

"Store.WaitingOnTransaction.Title" = "À espera de Autorização";
"Store.WaitingOnTransaction.Message" = "A sua compra está pendente aprovação do responsável de família.";

"Store.TransactionFailed.Title" = "Transação Falhou";
"Store.TransactionFailed.Message" = "Por favor tente novamente.";

"Store.OtherPlaformNotIncluded" = "Versão Premium para %@ vendida separadamente.";

// New item
"NewItem.FreeVersionLimit" = "A versão Grátis tem um limite de %d itens.";
"NewItem.ItemsLeft" = "Pode criar mais %d itens.";

/* Phrase for system's authentication prompt when unlocking secrets */
"DeviceAuthentication.AuthRequiredToUnlock" = "Autenticação necessária para destrancar os seus segredos";
"DeviceAuthentication.UnlockSecrets" = "Destrancar os seus segredos";
